# генерирует тестовые данные

categories = {1: "Манжета",
              2: "Пластина техническая",
              3: "Рукав всасывающий рабочий вакуум",
              4: "Болт головка шестигранная",
              5: "Гайка шестигранная покрытие цинковое",
              6: "Гвоздь строительный круглый головка плоская"}

num_items = [["* Манжета М50х70 ГОСТ 22704", "Манжета"],
             ["* Пластина техническая 2Н-I-ТМКЩ-С-4 ГОСТ 7338", "Пластина техническая"],
             ["* Рукав всасывающий В-1-75-У рабочий вакуум 0,08МПа ГОСТ 5398",
                 "Рукав всасывающий рабочий вакуум"],
             ["* Болт головка шестигранная M16х120.88 ГОСТ Р ИСО 4014",
                 "Болт головка шестигранная"],
             ["* Гайка шестигранная M30.6 покрытие цинковое ГОСТ 5915",
                 "Гайка шестигранная покрытие цинковое"],
             ["* Гвоздь строительный круглый головка плоская 3х80 ГОСТ 4028",
              "Гвоздь строительный круглый головка плоская"]]


suppliers = dict()

suppliers['2464257585'] = '«Промрезинотехника»'
suppliers['3123459248'] = 'Группа Компаний  Промтехмаш'
suppliers['4345242287'] = 'МТЗ Дилерский центр'
suppliers['5001117473'] = 'ПКФ Метсервис'
suppliers['5024131298'] = 'ГЛОБАЛСТРОЙРТИ'
suppliers['5024131298'] = 'Импульс'
suppliers['5027259480'] = 'АНИОЛ-НН'
suppliers['5029175901'] = 'Полимер-Сервис'
suppliers['5029208890'] = 'ВЕРТЕР'
suppliers['5042110340'] = 'Снабжающая Компания'
suppliers['5263112433'] = 'МОСТ-52'
suppliers['5405030933'] = 'А-Строй66'
suppliers['5410069100'] = '«Промрезинотехника»'
suppliers['5835135906'] = 'ПКФ Айсберг АС'
suppliers['5902039206'] = 'СнабЭнергоРесурс'
suppliers['5903122859'] = 'Камхимком'
suppliers['6167103692'] = 'СтилКо'
suppliers['6316214024'] = 'Промышленная металлургия'
suppliers['6317113621'] = 'АНТ-Технологии'
suppliers['6623134420'] = 'ВАШ ИНСТРУМЕНТ'
suppliers['6658491422'] = 'ПКФ ЦВЕТ Москва'
suppliers['6658504255'] = 'Завод РТИ BOREX'
suppliers['6658507129'] = 'УралСтройШоп'
suppliers['6670370745'] = 'ООО Стальметурал'
suppliers['6670415763'] = 'Химспецтрест'
suppliers['6670437083'] = 'ГУП УСИ -Москва'
suppliers['6671105517'] = 'Раббер Регион'
suppliers['6678045514'] = 'БСМ-Металл Москва'
suppliers['6678102427'] = 'ГЛОБАЛСТРОЙРТИ'
suppliers['6679043132'] = 'Мото-Квартал'
suppliers['6679056621'] = 'Анкур'
suppliers['6679103663'] = 'ТПК АГРО-96'
suppliers['6679122338'] = 'РТИ-ТОРГ'
suppliers['6679135440'] = 'Крепежный двор'
suppliers['6679135440'] = 'УралКрепёжДеталь, УКД'
suppliers['6685187326'] = 'БСМ-Металл'
suppliers['6685187326'] = 'ГЛОБАЛСТРОЙРТИ'
suppliers['6685187326'] = 'Промметгрупп'
suppliers['6686049135'] = 'МОСТ-52'
suppliers['6686049135'] = 'СтальЭнерго-96'
suppliers['6686049135'] = 'СтальЭнерго-96'
suppliers['6686056870'] = 'АвиаПромСталь'
suppliers['6686056870'] = 'ПКФ Айсберг АС'
suppliers['6686071268'] = 'АтлантГрупп'
suppliers['6686071268'] = 'МеталлЭнергоХолдинг'
suppliers['6686071268'] = 'МеталлЭнергоХолдинг'
suppliers['6686071268'] = 'МеталлЭнергоХолдинг'
suppliers['6686071268'] = 'МеталлЭнергоХолдинг'
suppliers['6686071268'] = 'ПКФ Метсервис'
suppliers['6686071268'] = 'СтальЭнерго-96'
suppliers['6686085239'] = 'Бизнес МС'
suppliers['6686085239'] = 'ТНМК'
suppliers['6686098693'] = 'Цветная металлургия'
suppliers['6686098693'] = 'Цветная металлургия'
suppliers['6686098693'] = 'ЭПО Бипром'
suppliers['7203381731'] = '«ПТК «Мотор»'
suppliers['7203381731'] = 'Компания Крепеж Профи'
suppliers['7447181399'] = 'Челябинский Завод Дорожной Техники'
suppliers['7449138060'] = 'Компания УРАЛМАШ'
suppliers['7452100934'] = 'Росэнерго-Чел'
suppliers['7453189981'] = 'ЛегПром'
suppliers['7702030351'] = 'БСМ-Металл'
suppliers['7702030351'] = 'БСМ-Металл Москва'
suppliers['7702030351'] = 'Макс М'
suppliers['7703370008'] = 'ДИСТ'
suppliers['7703370008'] = 'М-ЧЕЛ Москва'
suppliers['7703431758'] = 'МОСОПТТОРГ'
suppliers['7703431758'] = 'ЦентрСтройГрупп'
suppliers['7708344114'] = 'АтлантГрупп'
suppliers['7708344114'] = 'СтальЭнерго-96'
suppliers['7710023647'] = 'Гольфстрим'
suppliers['7710023647'] = 'ЭПО Бипром'
suppliers['7710759490'] = 'Нефтегазпродукт'
suppliers['7714360788'] = 'Гермес Групп'
suppliers['7714360788'] = 'Метиз-Мастер'
suppliers['7716851887'] = 'ВАШ ИНСТРУМЕНТ'
suppliers['7716851887'] = 'КМ'
suppliers['7716851887'] = 'MGP Metall'
suppliers['7720482329'] = 'МеталлЭнергоХолдинг'
suppliers['7720482329'] = 'Снабтехмет-Москва'
suppliers['7724422835'] = 'Компания Полимер'
suppliers['7724422835'] = 'МОСОПТТОРГ'
suppliers['7724422835'] = 'МОСОПТТОРГ'
suppliers['7724422835'] = 'СтальЭнерго-96'
suppliers['7724422835'] = 'ЭКО-РТИ-Холдинг'
suppliers['7725347771'] = '«НОВЫЕ ТЕХНОЛОГИИ»'
suppliers['7725347771'] = 'ООО Стальметурал'
suppliers['7727426228'] = 'Техальянс'
suppliers['7743272769'] = 'НОВЭМ'
suppliers['7743272769'] = 'РегионСпецСнаб'
suppliers['7751012877'] = 'Гермес Групп'
suppliers['7751012877'] = 'Крепежный двор'
suppliers['7810442063'] = 'КСМ - Комплексное Снабжение Материалами'
suppliers['7810442063'] = 'Нефтегазпродукт'
suppliers['7814697954'] = 'АвикомСервис'
suppliers['7816687736'] = 'Техно-СНАБ'
suppliers['7816687736'] = 'Цветная металлургия'
suppliers['7839482975'] = '«ПТК «Мотор»'
suppliers['7839482975'] = 'Завод РТИ BOREX'
suppliers['9201512326'] = 'КИН-Мет Москва'
suppliers['9201512326'] = 'КрокоСтрой'
suppliers['9723047409'] = 'Гидротрейд'


pair = []

pair.append(['1 ', '6670370745'])
pair.append(['1 ', '5410069100'])
pair.append(['1 ', '5410069100'])
pair.append(['1 ', '2464257585'])
pair.append(['1 ', '5024131298'])
pair.append(['1 ', '5029175901'])
pair.append(['1 ', '6686071268'])
pair.append(['1 ', '6686049135'])
pair.append(['1 ', '5902039206'])
pair.append(['1 ', '5027259480'])
pair.append(['1 ', '6679122338'])
pair.append(['1 ', '7452100934'])
pair.append(['1 ', '7839482975'])
pair.append(['1 ', '6670437083'])
pair.append(['1 ', '6678102427'])
pair.append(['1 ', '6686098693'])
pair.append(['1 ', '9723047409'])
pair.append(['1 ', '6679043132'])
pair.append(['1 ', '7727426228'])
pair.append(['1 ', '7447181399'])
pair.append(['1 ', '7710759490'])
pair.append(['1 ', '6317113621'])
pair.append(['1 ', '4345242287'])
pair.append(['1 ', '6679103663'])
pair.append(['1 ', '5835135906'])
pair.append(['1 ', '6670415763'])
pair.append(['1 ', '7449138060'])
pair.append(['1 ', '3123459248'])
pair.append(['1 ', '7814697954'])
pair.append(['2 ', '6679122338'])
pair.append(['2 ', '5027259480'])
pair.append(['2 ', '6670370745'])
pair.append(['2 ', '7743272769'])
pair.append(['2 ', '7743272769'])
pair.append(['2 ', '2464257585'])
pair.append(['2 ', '6658504255'])
pair.append(['2 ', '6658504255'])
pair.append(['2 ', '6658504255'])
pair.append(['2 ', '6316214024'])
pair.append(['2 ', '6685187326'])
pair.append(['2 ', '6685187326'])
pair.append(['2 ', '6685187326'])
pair.append(['2 ', '7839482975'])
pair.append(['2 ', '7724422835'])
pair.append(['2 ', '7724422835'])
pair.append(['2 ', '7724422835'])
pair.append(['2 ', '5024131298'])
pair.append(['2 ', '6671105517'])
pair.append(['2 ', '5835135906'])
pair.append(['2 ', '5835135906'])
pair.append(['2 ', '7720482329'])
pair.append(['2 ', '7720482329'])
pair.append(['2 ', '6686049135'])
pair.append(['2 ', '6686049135'])
pair.append(['2 ', '7810442063'])
pair.append(['2 ', '7810442063'])
pair.append(['2 ', '5410069100'])
pair.append(['2 ', '5410069100'])
pair.append(['2 ', '7453189981'])
pair.append(['3 ', '6686071268'])
pair.append(['3 ', '6686071268'])
pair.append(['3 ', '7816687736'])
pair.append(['3 ', '7816687736'])
pair.append(['3 ', '5410069100'])
pair.append(['3 ', '5410069100'])
pair.append(['3 ', '7839482975'])
pair.append(['3 ', '7839482975'])
pair.append(['3 ', '5042110340'])
pair.append(['3 ', '5042110340'])
pair.append(['3 ', '5024131298'])
pair.append(['3 ', '5024131298'])
pair.append(['3 ', '7725347771'])
pair.append(['3 ', '7725347771'])
pair.append(['3 ', '5027259480'])
pair.append(['3 ', '5027259480'])
pair.append(['3 ', '6679043132'])
pair.append(['3 ', '6679043132'])
pair.append(['3 ', '6686085239'])
pair.append(['3 ', '6686085239'])
pair.append(['3 ', '6686056870'])
pair.append(['3 ', '6686056870'])
pair.append(['3 ', '5263112433'])
pair.append(['3 ', '5263112433'])
pair.append(['3 ', '5903122859'])
pair.append(['3 ', '5903122859'])
pair.append(['3 ', '6658491422'])
pair.append(['3 ', '6658491422'])
pair.append(['4 ', '7703431758'])
pair.append(['4 ', '7703431758'])
pair.append(['4 ', '7708344114'])
pair.append(['4 ', '7708344114'])
pair.append(['4 ', '6686071268'])
pair.append(['4 ', '6686071268'])
pair.append(['4 ', '6623134420'])
pair.append(['4 ', '6623134420'])
pair.append(['4 ', '5029208890'])
pair.append(['4 ', '5029208890'])
pair.append(['4 ', '7203381731'])
pair.append(['4 ', '7203381731'])
pair.append(['4 ', '7710023647'])
pair.append(['4 ', '7710023647'])
pair.append(['4 ', '5410069100'])
pair.append(['4 ', '5410069100'])
pair.append(['4 ', '5405030933'])
pair.append(['4 ', '5405030933'])
pair.append(['4 ', '6678045514'])
pair.append(['4 ', '6678045514'])
pair.append(['4 ', '7751012877'])
pair.append(['4 ', '7751012877'])
pair.append(['4 ', '6679056621'])
pair.append(['4 ', '6679056621'])
pair.append(['4 ', '7703370008'])
pair.append(['4 ', '7703370008'])
pair.append(['4 ', '6658507129'])
pair.append(['5 ', '6686071268'])
pair.append(['5 ', '6686071268'])
pair.append(['5 ', '6623134420'])
pair.append(['5 ', '6623134420'])
pair.append(['5 ', '9201512326'])
pair.append(['5 ', '9201512326'])
pair.append(['5 ', '5029208890'])
pair.append(['5 ', '5029208890'])
pair.append(['5 ', '6679135440'])
pair.append(['5 ', '6679135440'])
pair.append(['5 ', '616400135510'])
pair.append(['5 ', '616400135510'])
pair.append(['5 ', '7714360788'])
pair.append(['5 ', '7714360788'])
pair.append(['5 ', '7724422835'])
pair.append(['5 ', '7724422835'])
pair.append(['5 ', '5001117473'])
pair.append(['5 ', '5001117473'])
pair.append(['5 ', '6686098693'])
pair.append(['5 ', '6686098693'])
pair.append(['5 ', '7716851887'])
pair.append(['5 ', '7716851887'])
pair.append(['5 ', '7716851887'])
pair.append(['5 ', '6167103692'])
pair.append(['5 ', '7702030351'])
pair.append(['5 ', '7702030351'])
pair.append(['5 ', '7702030351'])


dummy_items = list()
dummy_items.append('* Манжета М50х70 ГОСТ 22704 ')
dummy_items.append('* Манжета М65х90 ГОСТ 22704 ')
dummy_items.append('* Манжета М220х250 ГОСТ 22704 ')
dummy_items.append('* Манжета М60х80 ГОСТ 22704 ')
dummy_items.append(
    '* Манжета резиновая армированная для валов 1.2-120х150х12-1 ГОСТ 8752 ')
dummy_items.append('* Пластина техническая 2Н-I-ТМКЩ-С-4 ГОСТ 7338 ')
dummy_items.append(
    '* Рукав всасывающий В-1-75-У рабочий вакуум 0,08МПа ГОСТ 5398 ')
dummy_items.append(
    '* Рукав с текстильным каркасом В(II)-16-25-38-ХЛ ГОСТ 18698 ')
dummy_items.append('* Пластина техническая 1Н-I-ТМКЩ-С-5 ГОСТ 7338 ')
dummy_items.append(
    '* Манжета резиновая армированная для валов 1.2-90х120х12-1 ГОСТ 8752 ')
dummy_items.append('* Манжета М140х170 ГОСТ 22704 ')
dummy_items.append(
    '* Манжета резиновая армированная для валов 1.2-180х220х15-1 ГОСТ 8752 ')
dummy_items.append(
    '* Манжета резиновая армированная для валов 1.2-190х230х15-1 ГОСТ 8752 ')
dummy_items.append('* Рукав газосварочный I-6,3-0,63-У ГОСТ 9356 ')
dummy_items.append(
    '* Рукав с текстильным каркасом ВГ(III)-10-25-38-У ГОСТ 18698 ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7796, ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ M20Х80, КЛАСС ПРОЧНОСТИ 6.6, МАТЕРИАЛ СТАЛЬ ОЦИНКОВАННАЯ ')
dummy_items.append('* Болт головка шестигранная M16х120.88 ГОСТ Р ИСО 4014 ')
dummy_items.append('* Гайка шестигранная M30.6 покрытие цинковое ГОСТ 5915 ')
dummy_items.append(
    '* Гвоздь строительный круглый головка плоская 3х80 ГОСТ 4028 ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7817 DIN609, ОБОЗНАЧЕНИЕ M36-6GХ200, КЛАСС ПРОЧНОСТИ 10.9, МАТЕРИАЛ СТАЛЬ 40Х ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7796, ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ 2М10-6GХ28, КЛАСС ПРОЧНОСТИ 5.6, МАТЕРИАЛ СТАЛЬ ОЦИНКОВАННАЯ ')
dummy_items.append(
    '* Болт головка шестигранная M10х35.66 покрытие цинковое ГОСТ 7796 ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7817 DIN609, ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ 2.M30Х100, КЛАСС ПРОЧНОСТИ 5.8, МАТЕРИАЛ СТАЛЬ ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7798 ГОСТ7805, ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ 3.M12Х25, КЛАСС ПРОЧНОСТИ 5.8, МАТЕРИАЛ СТАЛЬ ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7808, ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ М24Х55, КЛАСС ПРОЧНОСТИ 5.6, МАТЕРИАЛ СТАЛЬ ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7817 DIN609, ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ M24Х80, КЛАСС ПРОЧНОСТИ 6.6, МАТЕРИАЛ СТАЛЬ ОЦИНКОВАННАЯ ')
dummy_items.append('* Гайка шестигранная M24.8 ГОСТ 5916 ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ7796, ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ 3M16Х30, КЛАСС ПРОЧНОСТИ 5.8 ')
dummy_items.append(
    '* Гайка шестигранная M30.8.35 покрытие цинковое ГОСТ 15521 ')
dummy_items.append(
    '* ГАЙКА; ТИП ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ M20, СТАНДАРТ ГОСТ15521, КЛАСС ПРОЧНОСТИ 5, МАТЕРИАЛ СТАЛЬ ОЦИНКОВАННАЯ ')
dummy_items.append(
    '* ГАЙКА; ОБОЗНАЧЕНИЕ M10, СТАНДАРТ ГОСТ15521, КЛАСС ПРОЧНОСТИ 5, МАТЕРИАЛ СТАЛЬ ОЦИНКОВАННАЯ ')
dummy_items.append(
    '* ГАЙКА; ОБОЗНАЧЕНИЕ M16, СТАНДАРТ ГОСТ15521, КЛАСС ПРОЧНОСТИ 5, МАТЕРИАЛ СТАЛЬ ОЦИНКОВАННАЯ ')
dummy_items.append(
    '* ШАЙБА; ТИП ПЛОСКАЯ УМЕНЬШЕННАЯ, СТАНДАРТ ГОСТ10450 DIN433, ОБОЗНАЧЕНИЕ А24, МАТЕРИАЛ СТАЛЬ 20 ОЦИНКОВАННАЯ ')
dummy_items.append(
    '* Гайка шестигранная M20х1,5.5 покрытие цинковое, хроматированное ГОСТ  15521 ')
dummy_items.append('* Гайка шестигранная M12.5 покрытие цинковое ГОСТ 15521 ')
dummy_items.append(
    '* Гайка шестигранная M12.8.35 покрытие цинковое ГОСТ 15521 ')
dummy_items.append('* Шайба плоская 16.32 ГОСТ 6958 ')
dummy_items.append(
    '* ГАЙКА; ОБОЗНАЧЕНИЕ М24-6Н.8.35.0112, СТАНДАРТ ГОСТ15521, КЛАСС ПРОЧНОСТИ 8, МАТЕРИАЛ СТАЛЬ 35 ОЦИНКОВАННАЯ ')
dummy_items.append('* Гайка шестигранная M42х3.8 покрытие цинковое ГОСТ 5915 ')
dummy_items.append(
    '* БОЛТ; СТАНДАРТ ГОСТ Р ИСО4014 DIN931 (ГОСТ7798/7805), ГОЛОВКА ШЕСТИГРАННАЯ, ОБОЗНАЧЕНИЕ M16Х65, КЛАСС ПРОЧНОСТИ 8.8, МАТЕРИАЛ СТАЛЬ/ ОЦИНКОВАННАЯ ')
